In [2]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import MinMaxScaler
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score

In [37]:
df = pd.read_csv("sales_pos.csv")
df.head(3)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,F,0-17,10,A,0,3,NaN,NaN,8370
1,1,P00248942,F,0-17,10,A,0,1,6.0,14.0,15200
2,1,P00087842,F,0-17,10,A,0,12,NaN,NaN,1422

In [6]:
df.columns

Index(['user', 'prod', 'gender', 'age_group', 'job', 'city', 'marital',
       'prod_cat1', 'prod_cat2', 'prod_cat3', 'purchase'],
      dtype='object')

# Q1

In [48]:
df.groupby("prod")[["purchase"]].sum().sort_values("purchase", ascending=False)

           purchase
prod
P00025442  27995166
P00110742  26722309
P00255842  25168963
P00059442  24338343
P00184942  24334887
...             ...
P00012942      1717
P00325342      1656
P00353042      1545
P00309042       726
P00091742       405

[3631 rows x 1 columns]

In [66]:
df[df["prod"]=="P00025442"].groupby("job")[["job"]].count()

     job
job
0    179
1    124
2     78
3     46
4    221
5     31
6     54
7    187
8      3
9     12
10    55
11    38
12   117
13    24
14    84
15    50
16    60
17   143
18    14
19    20
20    75

# Q2

In [71]:
df_2_1 = df[df["age_group"]=="26-35"]
df_2_1.head(3)
#len(df_2_1)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
5,3,P00193542,M,26-35,15,A,0,1,2.0,NaN,15227
9,5,P00274942,M,26-35,20,A,1,8,NaN,NaN,7871
10,5,P00251242,M,26-35,20,A,1,5,11.0,NaN,5254

In [79]:
df_2_1.isnull().sum()

user              0
prod              0
gender            0
age_group         0
job               0
city              0
marital           0
prod_cat1         0
prod_cat2     69427
prod_cat3    152645
purchase          0
dtype: int64

In [80]:
df_2_2 = df_2_1.fillna(0)

In [81]:
df_2_2.isnull().sum()

user         0
prod         0
gender       0
age_group    0
job          0
city         0
marital      0
prod_cat1    0
prod_cat2    0
prod_cat3    0
purchase     0
dtype: int64

In [82]:
df_2_2.dtypes

user           int64
prod          object
gender        object
age_group     object
job            int64
city          object
marital        int64
prod_cat1      int64
prod_cat2    float64
prod_cat3    float64
purchase       int64
dtype: object

In [91]:
df_2_2 = df_2_2.astype({'prod_cat1':'str'})
df_2_2 = df_2_2.astype({'prod_cat2':'str'})
df_2_2 = df_2_2.astype({'prod_cat3':'str'})

In [92]:
df_2_2.dtypes

user          int64
prod         object
gender       object
age_group    object
job           int64
city         object
marital       int64
prod_cat1    object
prod_cat2    object
prod_cat3    object
purchase      int64
dtype: object

In [93]:
df_2_2.head(3)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
5,3,P00193542,M,26-35,15,A,0,1,2,0,15227
9,5,P00274942,M,26-35,20,A,1,8,0,0,7871
10,5,P00251242,M,26-35,20,A,1,5,11,0,5254

In [95]:
df_2_2["prod_cat"] = df_2_2["prod_cat1"] + "-" + df_2_2["prod_cat2"] + "-" + df_2_2["prod_cat3"]
df_2_2.head(3)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase,prod_cat
5,3,P00193542,M,26-35,15,A,0,1,2,0,15227,1-2-0
9,5,P00274942,M,26-35,20,A,1,8,0,0,7871,8-0-0
10,5,P00251242,M,26-35,20,A,1,5,11,0,5254,5-11-0

In [109]:
df_2_2.groupby('user').filter("marital"=="1")

TypeError: 'bool' object is not callable

# ===============================================

In [152]:
df = pd.read_csv("sales_pos.csv")
df.head(3)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,F,0-17,10,A,0,3,NaN,NaN,8370
1,1,P00248942,F,0-17,10,A,0,1,6.0,14.0,15200
2,1,P00087842,F,0-17,10,A,0,12,NaN,NaN,1422

# Q1

In [112]:
df_q1 = df[['prod', 'job', 'purchase']].copy()
df_q1.head(3)

        prod  job  purchase
0  P00069042   10      8370
1  P00248942   10     15200
2  P00087842   10      1422

In [113]:
df_q1.groupby('prod')['purchase'].sum()

prod
P00000142    12837476
P00000242     3967496
P00000342     1296475
P00000442      441173
P00000542      807212
               ...
P0099442      2870383
P0099642        83710
P0099742       991948
P0099842       737312
P0099942        78019
Name: purchase, Length: 3631, dtype: int64

In [114]:
df_q1.groupby('prod')['purchase'].sum().max()

27995166

In [116]:
top_prod = df_q1.groupby('prod')['purchase'].sum().idxmax()
top_prod

'P00025442'

In [117]:
df_q1.loc[df_q1['prod'] == top_prod, ]

             prod  job  purchase
667     P00025442   17     19706
749     P00025442    7     15212
833     P00025442    7     15255
1134    P00025442    1     15223
1205    P00025442   12     19296
...           ...  ...       ...
544755  P00025442    7     19072
544780  P00025442    4     19665
545079  P00025442   17     15284
545206  P00025442    2     15338
545665  P00025442    0     15448

[1615 rows x 3 columns]

In [118]:
df_q1.loc[df_q1['prod'] == top_prod, 'job'].value_counts().idxmax()

4

In [119]:
df_q1_sub = df_q1.loc[df_q1['prod'] == top_prod, ]
df_q1_sub.groupby('job')['purchase'].sum().idxmax()

4

# Q2

In [148]:
df_id1 = df.loc[df['user'] == 1, ['prod_cat1', 'prod_cat2', 'prod_cat3']]
df_id1.head(3)

   prod_cat1  prod_cat2  prod_cat3
0          3        NaN        NaN
1          1        6.0       14.0
2         12        NaN        NaN

In [149]:
df_id1 = df_id1.fillna(0).reset_index(drop = True)
df_id1.head(3)

   prod_cat1  prod_cat2  prod_cat3
0          3        0.0        0.0
1          1        6.0       14.0
2         12        0.0        0.0

In [150]:
df_id1.shape

(35, 3)

In [151]:
df_id1.drop_duplicates().shape

(21, 3)

In [130]:
df_id1['cnt'] = 1
df_id1_agg = df_id1.groupby(['prod_cat1', 'prod_cat2', 'prod_cat3'])['cnt'].sum()
df_id1_agg = df_id1_agg.reset_index()
df_id1_agg.shape
df_id1_agg.head(3)

   prod_cat1  prod_cat2  prod_cat3  cnt
0          1        2.0        5.0    1
1          1        2.0        9.0    1
2          1        6.0       14.0    1

In [131]:
df_id1['prod_cat1'] = df_id1['prod_cat1'].astype('int').astype('str')
df_id1['prod_cat2'] = df_id1['prod_cat2'].astype('int').astype('str')
df_id1['prod_cat3'] = df_id1['prod_cat3'].astype('int').astype('str')

In [132]:
df_id1.dtypes

prod_cat1    object
prod_cat2    object
prod_cat3    object
cnt           int64
dtype: object

In [134]:
df_id1['prod_cat'] = df_id1['prod_cat1'] + "-" + df_id1['prod_cat2'] + "-" + df_id1['prod_cat3']

In [135]:
df_id1['prod_cat'].nunique()

21

# Q2

In [161]:
df['age_group'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [162]:
df_q2 = df.loc[df['age_group'] == '26-35', ]
df_q2 = df_q2[['user', 'marital', 'prod_cat1', 'prod_cat2', 'prod_cat3']]
df_q2 = df_q2.fillna(0).reset_index(drop = True)

In [163]:
df_q2.head(3)

   user  marital  prod_cat1  prod_cat2  prod_cat3
0     3        0          1        2.0        0.0
1     5        1          8        0.0        0.0
2     5        1          5       11.0        0.0

In [164]:
df_q2['prod_cat1'] = df_q2['prod_cat1'].astype('int').astype('str')
df_q2['prod_cat2'] = df_q2['prod_cat2'].astype('int').astype('str')
df_q2['prod_cat3'] = df_q2['prod_cat3'].astype('int').astype('str')
df_q2['prod_cat'] = df_q2['prod_cat1'] + "-" + df_q2['prod_cat2'] + "-" + df_q2['prod_cat3']

In [165]:
df_q2.head(3)

   user  marital prod_cat1 prod_cat2 prod_cat3 prod_cat
0     3        0         1         2         0    1-2-0
1     5        1         8         0         0    8-0-0
2     5        1         5        11         0   5-11-0

In [166]:
df_q2_agg = df_q2.groupby(['user', 'marital'])['prod_cat'].nunique().reset_index()
df_q2_agg.head(3)

   user  marital  prod_cat
0     3        0        18
1     5        1        43
2     8        1        32

In [167]:
df_q2['user'].nunique(), len(df_q2_agg)

(2053, 2053)

In [168]:
stat_m0 = df_q2_agg.loc[df_q2_agg['marital'] == 0, 'prod_cat'].mean()
stat_m1 = df_q2_agg.loc[df_q2_agg['marital'] == 1, 'prod_cat'].mean()

In [169]:
stat_m0, stat_m1, round(abs(stat_m0 - stat_m1), 2)

(41.66318327974277, 41.79233621755253, 0.13)

# Q3

In [170]:
df.head(3)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,F,0-17,10,A,0,3,NaN,NaN,8370
1,1,P00248942,F,0-17,10,A,0,1,6.0,14.0,15200
2,1,P00087842,F,0-17,10,A,0,12,NaN,NaN,1422

In [172]:
df['user'].nunique()

5891

In [173]:
df_q3_user = df.iloc[:, [0,2,3,4,5,6]].drop_duplicates()
df_q3_user.head(3)

   user gender age_group  job city  marital
0     1      F      0-17   10    A        0
4     2      M       55+   16    C        0
5     3      M     26-35   15    A        0

In [174]:
df_q3_agg1 = df.groupby('user')['prod'].nunique().reset_index()
df_q3_agg2 = df.groupby('user')['purchase'].sum().reset_index()

In [175]:
df_q3_agg1.head(3)

   user  prod
0     1    35
1     2    77
2     3    29

In [176]:
df_q3_join = df_q3_user.merge(df_q3_agg1, on = 'user')
df_q3_join = df_q3_join.merge(df_q3_agg2, on = 'user')

In [177]:
df_q3_join.head(3)

   user gender age_group  job city  marital  prod  purchase
0     1      F      0-17   10    A        0    35    334093
1     2      M       55+   16    C        0    77    810472
2     3      M     26-35   15    A        0    29    341635

In [181]:
df_q3_dum = pd.get_dummies(df_q3_join, columns = ['job', 'city'])
df_q3_dum.head(3)

,user,gender,age_group,marital,prod,purchase,job_0,job_1,job_2,job_3,...,job_14,job_15,job_16,job_17,job_18,job_19,job_20,city_A,city_B,city_C
0,1,F,0-17,0,35,334093,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,2,M,55+,0,77,810472,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1
2,3,M,26-35,0,29,341635,0,0,0,0,...,0,1,0,0,0,0,0,1,0,0

In [182]:
df_q3_dum = df_q3_dum.drop(columns = 'user')
df_q3_dum.head(3)

,gender,age_group,marital,prod,purchase,job_0,job_1,job_2,job_3,job_4,...,job_14,job_15,job_16,job_17,job_18,job_19,job_20,city_A,city_B,city_C
0,F,0-17,0,35,334093,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,M,55+,0,77,810472,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1
2,M,26-35,0,29,341635,0,0,0,0,0,...,0,1,0,0,0,0,0,1,0,0

In [184]:
df_q3_dum['genter'] = df_q3_dum['gender'].replace({"M":1, "F":0})

In [185]:
df_q3_dum['age_group'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [186]:
ser_repl = pd.Series(df_q3_dum['age_group'].unique())
ser_repl

0     0-17
1      55+
2    26-35
3    46-50
4    51-55
5    36-45
6    18-25
dtype: object

In [187]:
ser_repl = ser_repl.sort_values().reset_index(drop = True)
ser_repl

0     0-17
1    18-25
2    26-35
3    36-45
4    46-50
5    51-55
6      55+
dtype: object

In [188]:
ser_repl = pd.Series(ser_repl.index, index = ser_repl)
ser_repl

0-17     0
18-25    1
26-35    2
36-45    3
46-50    4
51-55    5
55+      6
dtype: int64

In [190]:
a = df['age_group'].sort_values().unique()
dict(zip(a, range(len(a))))

{'0-17': 0,
 '18-25': 1,
 '26-35': 2,
 '36-45': 3,
 '46-50': 4,
 '51-55': 5,
 '55+': 6}

In [189]:
pd.crosstab(df_q3_dum['age_group'], df_q3_dum['age_group'].replace(ser_repl))

age_group    0     1     2     3    4    5    6
age_group
0-17       218     0     0     0    0    0    0
18-25        0  1069     0     0    0    0    0
26-35        0     0  2053     0    0    0    0
36-45        0     0     0  1167    0    0    0
46-50        0     0     0     0  531    0    0
51-55        0     0     0     0    0  481    0
55+          0     0     0     0    0    0  372

In [191]:
df_q3_dum['age_group'] = df_q3_dum['age_group'].replace(ser_repl)

In [192]:
df_q3_dum.head(3)

,gender,age_group,marital,prod,purchase,job_0,job_1,job_2,job_3,job_4,...,job_15,job_16,job_17,job_18,job_19,job_20,city_A,city_B,city_C,genter
0,F,0,0,35,334093,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0
1,M,6,0,77,810472,0,0,0,0,0,...,0,1,0,0,0,0,0,0,1,1
2,M,2,0,29,341635,0,0,0,0,0,...,1,0,0,0,0,0,1,0,0,1

In [193]:
df_q3_dum_nor = MinMaxScaler().fit_transform(df_q3_dum)

ValueError: could not convert string to float: 'F'